package homework_03.task_05;

public class Oracle {

/*
Задание 5
Зайдите на сайт Oracle. Используя поисковые механизмы Oracle,
найдите самостоятельно описание темы по каждому примеру, который был рассмотрен на уроке, так, как это представлено ниже,
в разделе «Рекомендуемые ресурсы», описания данного урока.
Сохраните ссылки и дайте им короткое описание.
 */

/*
    Полиморфизм
https://docs.oracle.com/javase/tutorial/java/IandI/polymorphism.html
Подклассы класса могут определять свое собственное уникальное поведение
и при этом использовать некоторые из тех же функций родительского класса.


    Наследование
https://docs.oracle.com/javase/tutorial/java/IandI/subclasses.html
Определения:  Класс, производный от другого класса, называется подклассом (также производным классом , расширенным классом или дочерним классом ).
Класс, от которого происходит подкласс, называется суперклассом (также базовым классом или родительским классом ).

Модификатор final
https://docs.oracle.com/javase/tutorial/java/IandI/final.html
Написание окончательных классов и методов
 */
}
